Ran Plan for project: `seagl` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # aws_db_instance.pretalx will be updated in-place
~ resource "aws_db_instance" "pretalx" {
        id                                    = "pretalx-prod"
        name                                  = "pretalx"
        tags                                  = {}
        # (52 unchanged attributes hidden)
    }

  # aws_route53_record.bsky-verification-txt will be created
+ resource "aws_route53_record" "bsky-verification-txt" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_atproto.seagl.org"
      + records         = [
          + "did=did:plc:hogmnov6mwgz6mhw2h7763gm",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # module.prod_db.aws_db_instance.osem will be updated in-place
~ resource "aws_db_instance" "osem" {
      ~ engine_version                        = "10.6.20" -> "10.6.18"
        id                                    = "osem"
        name                                  = "osem"
        tags                                  = {}
        # (52 unchanged attributes hidden)
    }

  # module.prod_db.aws_secretsmanager_secret_version.osem-db-pass-val will be updated in-place
~ resource "aws_secretsmanager_secret_version" "osem-db-pass-val" {
        id             = "arn:aws:secretsmanager:us-west-2:663166083306:secret:db-pass-osem-5KW1mS|5E8ED816-E9AA-4E8E-A382-2EEE9FC74A66"
        # (5 unchanged attributes hidden)
    }

  # module.prod_db.random_password.osem_db_master_pass will be updated in-place
~ resource "random_password" "osem_db_master_pass" {
        id               = "none"
        # (14 unchanged attributes hidden)
    }

  # module.production_env.aws_route53_record.dokku_wildcard will be updated in-place
~ resource "aws_route53_record" "dokku_wildcard" {
        id                               = "Z0173878287JIU5M4KB8R_*.seagl.org_CNAME"
        name                             = "*.seagl.org"
      ~ records                          = [
          - "dokku.host.seagl.org",
          + "dokku.seagl.org",
        ]
      ~ ttl                              = 30 -> 300
        # (4 unchanged attributes hidden)
    }

  # module.production_env.module.docker-cluster-vm.openstack_compute_instance_v2.instance will be updated in-place
~ resource "openstack_compute_instance_v2" "instance" {
        id                  = "4afb87f5-5395-4931-968c-7a685f5b1b6c"
        name                = "docker-cluster"
        tags                = []
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.production_env.module.docker-cluster-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["2375"] will be destroyed
  # (because key ["2375"] is not in for_each map)
- resource "openstack_networking_secgroup_rule_v2" "tcp4-ingress" {
      - direction         = "ingress" -> null
      - ethertype         = "IPv4" -> null
      - id                = "eede90e7-07f7-4c7c-9dcb-8cace9b864e0" -> null
      - port_range_max    = 2375 -> null
      - port_range_min    = 2375 -> null
      - protocol          = "tcp" -> null
      - region            = "RegionOne" -> null
      - remote_ip_prefix  = "0.0.0.0/0" -> null
      - security_group_id = "07fbc3a6-e1cf-40d6-964d-a53b7d95c139" -> null
      - tenant_id         = "03cbb624d5be494d95af475e74fcb47b" -> null
    }

  # module.production_env.module.docker-cluster-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["443"] will be destroyed
  # (because key ["443"] is not in for_each map)
- resource "openstack_networking_secgroup_rule_v2" "tcp4-ingress" {
      - direction         = "ingress" -> null
      - ethertype         = "IPv4" -> null
      - id                = "019bb4c5-3140-4043-9199-cb4c0d9ef96a" -> null
      - port_range_max    = 443 -> null
      - port_range_min    = 443 -> null
      - protocol          = "tcp" -> null
      - region            = "RegionOne" -> null
      - remote_ip_prefix  = "0.0.0.0/0" -> null
      - security_group_id = "07fbc3a6-e1cf-40d6-964d-a53b7d95c139" -> null
      - tenant_id         = "03cbb624d5be494d95af475e74fcb47b" -> null
    }

  # module.production_env.module.docker-cluster-vm.openstack_networking_secgroup_rule_v2.tcp4-ranged-ingress["23000"] will be destroyed
  # (because key ["23000"] is not in for_each map)
- resource "openstack_networking_secgroup_rule_v2" "tcp4-ranged-ingress" {
      - direction         = "ingress" -> null
      - ethertype         = "IPv4" -> null
      - id                = "35feeff6-feac-4857-a3ea-f6ea922c4c43" -> null
      - port_range_max    = 23050 -> null
      - port_range_min    = 23000 -> null
      - protocol          = "tcp" -> null
      - region            = "RegionOne" -> null
      - remote_ip_prefix  = "0.0.0.0/0" -> null
      - security_group_id = "07fbc3a6-e1cf-40d6-964d-a53b7d95c139" -> null
      - tenant_id         = "03cbb624d5be494d95af475e74fcb47b" -> null
    }

  # module.production_env.module.dokku-vm.openstack_compute_instance_v2.instance will be updated in-place
~ resource "openstack_compute_instance_v2" "instance" {
        id                  = "c9cea52c-d27f-4fd6-a676-eee301b9c9d7"
        name                = "dokku"
        tags                = []
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.production_env.module.mailu-vm.openstack_compute_instance_v2.instance will be updated in-place
~ resource "openstack_compute_instance_v2" "instance" {
        id                  = "c388c80b-fa29-40fe-ae0b-e93803e87b22"
        name                = "mailu"
        tags                = []
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.production_env.module.shell-vm.openstack_compute_instance_v2.instance will be updated in-place
~ resource "openstack_compute_instance_v2" "instance" {
        id                  = "34b4bed0-0b91-4205-a10b-96d7b3f55bf1"
        name                = "shell"
        tags                = []
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 9 to change, 3 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
│   on provider.tf line 34, in provider "openstack":
│   34: provider "openstack" {
│ 
│ Users not using loadbalancer resources can ignore this message. Support for
│ neutron-lbaas will be removed on next major release. Octavia will be the
│ only supported method for loadbalancer resources. Users using octavia will
│ have to remove 'use_octavia' option from the provider configuration block.
│ Users using neutron-lbaas will have to migrate/upgrade to octavia.
│ 
│ (and 5 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p seagl`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.seagl.org/lock?id=SeaGL%252Fseagl-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p seagl`
</details>
Plan: 1 to add, 9 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`